davelee98/Firmware_Unified/targets/esp32-idf/src/device_control.cpp
#include "device_control.h"
#include "structs.h"
#include "touch_input.h"
#include "power_latch.h"
#include "buzzer_control.h"
#include "od_log.h"
#include <string.h>

#ifdef TARGET_ESP32
void enterDeepSleep(bool force = false, uint16_t overrideSleepSeconds = 0);
#endif

#ifdef TARGET_NRF
#include <bluefruit.h>
#include "ble_init.h"
extern "C" {
#include "nrf_soc.h"
}
extern "C" void bootloader_util_app_start(uint32_t start_addr);
#endif
#ifdef TARGET_ESP32
#include <esp_system.h>
#include "driver/gpio.h"
#include "esp32-hal-gpio.h"
#include "ble_init.h"          // BLEDevice/BLEServer/BLEAdvertising aliases + esp32_ble_clear_handles()
#include "wifi_service.h"      // OPENDISPLAY_HAS_WIFI + opendisplay_lan_teardown()
extern BLEServer* pServer;     // defined in main.cpp
#endif

extern uint8_t rebootFlag;
extern struct GlobalConfig globalConfig;
extern uint8_t activeLedInstance;
extern bool ledFlashActive;
extern uint8_t ledFlashPosition;
extern uint8_t dynamicreturndata[11];
extern uint8_t buttonStateCount;
extern volatile bool buttonEventPending;
extern volatile uint8_t lastChangedButtonIndex;
void updatemsdata();
void cleanupDirectWriteState(bool refreshDisplay);
void cleanupPartialWriteOnDisconnect(void);
void resetPipeWriteState(void);
void sendResponse(uint8_t* response, uint16_t len);

extern ButtonState buttonStates[MAX_BUTTONS];

#ifdef TARGET_ESP32
static bool s_pwrOffReleased[MAX_BUTTONS];
static bool s_pwrOffPressing[MAX_BUTTONS];
static bool s_pwrOffDone[MAX_BUTTONS];
static uint32_t s_pwrOffStartMs[MAX_BUTTONS];

static void pollConfiguredPowerOffButtons() {
    if (!powerLatchDffConfigured() && !powerLatchMosfetConfigured()) {
        return;
    }
    for (uint8_t i = 0; i < buttonStateCount; i++) {
        ButtonState* btn = &buttonStates[i];
        if (!btn->initialized || !btn->power_off) {
            continue;
        }
        bool pinState = digitalRead(btn->pin);
        bool down = btn->inverted ? !pinState : pinState;
        if (!down) {
            s_pwrOffReleased[i] = true;
            s_pwrOffPressing[i] = false;
            s_pwrOffDone[i] = false;
            continue;
        }
        if (!s_pwrOffReleased[i]) {
            continue;
        }
        if (!s_pwrOffPressing[i]) {
            s_pwrOffPressing[i] = true;
            s_pwrOffStartMs[i] = millis();
            continue;
        }
        if (!s_pwrOffDone[i] && millis() - s_pwrOffStartMs[i] >= btn->power_off_hold_ms) {
            s_pwrOffDone[i] = true;
            passiveBuzzerPowerOffAlert();
            powerLatchTriggerOff();
        }
    }
}

// BinaryInputs.input_type wire values (see structs.h for the full contract).
// 2 is reserved for switches (host-side feature); the ADC ladder uses 3.
#define BINARY_INPUT_TYPE_ADC_LADDER 3

// --- ADC resistor-ladder buttons (e.g. XTEINK X4) -------------------------
// Several buttons share one ADC pin via a resistor ladder, distinguished by
// voltage. They have no edge interrupt, so they are polled. Reported through
// the same MSD button byte as digital buttons for a uniform host contract.
#define MAX_ADC_LADDERS     4
#define MAX_LADDER_BUTTONS  4    // reserved[] holds at most N+1 = 5 LE uint16 thresholds
#define ADC_LADDER_POLL_MS  5
#define ADC_LADDER_DEBOUNCE 3    // consecutive equal samples required to accept a change

// Thresholds for N+1 buttons must fit in BinaryInputs.reserved[]; fail the build if not.
static_assert(2 + 2 * (MAX_LADDER_BUTTONS + 1) <= sizeof(BinaryInputs::reserved),
              "ADC ladder thresholds would overflow BinaryInputs.reserved[]");

struct AdcLadder {
    uint8_t  pin;
    uint8_t  num_buttons;
    uint8_t  id_base;
    uint8_t  byte_index;
    uint16_t thresholds[MAX_LADDER_BUTTONS + 1];  // descending; [0] = idle ceiling
    int8_t   current_button;     // -1 = none pressed
    int8_t   candidate_button;   // debounce: last raw classification
    uint8_t  candidate_count;    // consecutive samples equal to candidate
    uint8_t  press_count;        // 0-15, increments per press (5 s reset window)
    uint8_t  last_button_id;     // id of most recent press (for clean release reporting)
    uint32_t last_press_time;
};
static AdcLadder adcLadders[MAX_ADC_LADDERS];
static uint8_t   adcLadderCount = 0;

// Returns button index 0..num_buttons-1, or -1 when nothing is pressed.
static int classifyAdcLadder(int adc, const AdcLadder* l) {
    if (adc > (int)l->thresholds[0]) return -1;            // above idle ceiling
    for (uint8_t i = 0; i < l->num_buttons; i++) {
        if (adc > (int)l->thresholds[i + 1]) return (int)i; // thr[i+1] < adc <= thr[i]
    }
    return (int)l->num_buttons - 1;                        // catch-all bottom bucket
}

static void registerAdcLadder(const struct BinaryInputs* input) {
    if (adcLadderCount >= MAX_ADC_LADDERS) return;
    uint8_t n = input->reserved[0];                        // num_buttons
    if (n == 0 || n > MAX_LADDER_BUTTONS) {
        od_log_warn("ADC ladder: count %u out of range 1..%u on pin %u, skipping",
                    n, MAX_LADDER_BUTTONS, input->input_pin_1);
        return;
    }
    if (input->button_data_byte_index > 10) {              // index into the 11-byte MSD block
        od_log_warn("ADC ladder: byte_index %u out of range 0..10 on pin %u, skipping",
                    input->button_data_byte_index, input->input_pin_1);
        return;
    }
    if ((int)input->reserved[1] + n > 8) {                 // 3-bit id field: id_base..id_base+n-1 must be <= 7
        od_log_warn("ADC ladder: id_base %u + count %u exceeds 3-bit id space on pin %u, skipping",
                    input->reserved[1], n, input->input_pin_1);
        return;
    }
    AdcLadder* l = &adcLadders[adcLadderCount];
    l->pin = input->input_pin_1;                            // ADC GPIO
    l->num_buttons = n;
    l->id_base = input->reserved[1];
    l->byte_index = input->button_data_byte_index;
    for (uint8_t k = 0; k <= n; k++) {
        l->thresholds[k] = (uint16_t)input->reserved[2 + 2 * k] |
                           ((uint16_t)input->reserved[3 + 2 * k] << 8);
    }
    for (uint8_t k = 0; k < n; k++) {                      // contract: thresholds strictly descending
        if (l->thresholds[k] <= l->thresholds[k + 1]) {    // reject malformed config from any host
            od_log_warn("ADC ladder: thresholds not strictly descending on pin %u, skipping", input->input_pin_1);
            return;
        }
    }
    l->current_button = -1;
    l->candidate_button = -1;
    l->candidate_count = 0;
    l->press_count = 0;
    l->last_button_id = (uint8_t)(l->id_base & 0x07);
    l->last_press_time = 0;
    pinMode(l->pin, INPUT);
    analogSetPinAttenuation(l->pin, ADC_11db);
    adcLadderCount++;
    od_log_info("ADC ladder: pin %u n %u idBase %u byteIdx %u", l->pin, n, l->id_base, l->byte_index);
}

static void pollAdcButtons() {
    if (adcLadderCount == 0) return;
    static uint32_t lastPoll = 0;
    uint32_t now = millis();
    if (now - lastPoll < ADC_LADDER_POLL_MS) return;
    lastPoll = now;
    for (uint8_t i = 0; i < adcLadderCount; i++) {
        AdcLadder* l = &adcLadders[i];
        int adc = analogRead(l->pin);
        int btn = classifyAdcLadder(adc, l);
        if (btn == l->candidate_button) {
            if (l->candidate_count < 255) l->candidate_count++;
        } else {
            l->candidate_button = (int8_t)btn;
            l->candidate_count = 1;
        }
        if (l->candidate_count < ADC_LADDER_DEBOUNCE) continue;  // not yet stable
        if (btn == l->current_button) continue;                 // no change
        uint8_t state;
        if (btn >= 0) {
            if (l->last_press_time == 0 || now - l->last_press_time > 5000) l->press_count = 0;
            l->press_count = (uint8_t)((l->press_count + 1) & 0x0F);
            l->last_press_time = now;
            l->last_button_id = (uint8_t)((l->id_base + btn) & 0x07);
            state = 1;
        } else {
            state = 0;  // released; last_button_id identifies which button
        }
        l->current_button = (int8_t)btn;
        uint8_t data = (uint8_t)((l->last_button_id & 0x07) |
                                 ((l->press_count & 0x0F) << 3) |
                                 ((state & 0x01) << 7));
        if (l->byte_index < 11) dynamicreturndata[l->byte_index] = data;
        updatemsdata();
        od_log_debug("ADC btn pin %u adc=%d idx=%d id=%u cnt=%u state=%u",
                    l->pin, adc, btn, l->last_button_id, l->press_count, state);
    }
}
#else
static void pollAdcButtons() {}
#endif

