davelee98/Firmware_Unified/targets/esp32-idf/src/device_control.cpp
void connect_callback(uint16_t conn_handle) {
    (void)conn_handle;
    od_log_info("=== BLE CLIENT CONNECTED ===");
    rebootFlag = 0;
    updatemsdata();
#ifdef TARGET_NRF
    ble_nrf_log_link_params(conn_handle, "at connect");  // baseline (pre-negotiation)
    ble_nrf_request_fast_link(conn_handle);              // request 2M PHY + 251-octet DLE
    ble_nrf_arm_link_diag(conn_handle);                  // re-log once negotiation settles
#endif
}

void disconnect_callback(uint16_t conn_handle, uint8_t reason) {
    (void)conn_handle;
    (void)reason;
    od_log_info("=== BLE CLIENT DISCONNECTED ===");
    od_log_info("Disconnect reason: %u", reason);
    // Panel power on disconnect follows the ACTIVE-only-teardown invariant, so no
    // logic change is needed here: a WARM (post-successful-refresh) panel SURVIVES
    // disconnect and keeps its keep-alive window — a reconnect within the window
    // pays only a warm re-acquire. Only a disconnect mid-transfer (still PWR_ACTIVE) tears the
    // panel down, via the cleanup calls below (which no-op on power when WARM).
    cleanupDirectWriteState(true);
    cleanupPartialWriteOnDisconnect();   // 0x76 / pipe-partial session bookkeeping + panel power
    resetPipeWriteState();   // clear any pipe transfer + reorder queue on disconnect
}

#ifdef TARGET_ESP32
// Tear NimBLE down before esp_restart(): esp_restart() resets the CPU but NOT the
// BT controller hardware, so on the next (software-reset) boot BLEDevice::init()
// tries to enable an already-enabled controller and aborts -> PANIC boot loop that
// only a physical power cycle clears. Mirrors the deep-sleep teardown in
// enterDeepSleep() (main.cpp), which is why sleep->wake re-inits cleanly.
static void esp32_ble_deinit_before_restart() {
#ifdef OPENDISPLAY_HAS_WIFI
    // F5 (extends PR #114): esp_restart() resets the CPU but not the WiFi radio or
    // open sockets/TLS context. Tear the LAN listener + mbedTLS state down first so
    // the next boot re-inits WiFi cleanly (mirrors the BLE deinit below).
    opendisplay_lan_teardown();
#endif
    if (pServer != nullptr) {
        BLEAdvertising* pAdvertising = pServer->getAdvertising();
        if (pAdvertising != nullptr) pAdvertising->stop();
    }
    delay(200);
    /* Was BLEDevice::deinit(true); the port briefly replaced it with od_ble_stop_advertising(),
     * which does not touch the controller at all -- contradicting the comment above, which is
     * the whole reason this function exists. od_ble_deinit() stops the host AND releases the
     * controller, which is what BLEDevice::deinit(true) did. */
    od_ble_deinit();
    esp32_ble_clear_handles();
    delay(100);
    od_log_info("BLE deinitialized before restart");
}
#endif

void reboot(){
    // Banner logged by the dispatcher (commandName() in communication.cpp).
    delay(100);
#ifdef TARGET_NRF
    NVIC_SystemReset();
#endif
#ifdef TARGET_ESP32
    esp32_ble_deinit_before_restart();
    esp_restart();
#endif
}

#define LED_DELAY_FACTOR_MS 100u
#define LED_MIN_STEP_DELAY_MS 1u

typedef enum {
    LED_PHASE_IDLE = 0,
    LED_PHASE_GROUP,
    LED_PHASE_LOOP1,
    LED_PHASE_LOOP1_DELAY,
    LED_PHASE_INTER1_DELAY,
    LED_PHASE_LOOP2,
    LED_PHASE_LOOP2_DELAY,
    LED_PHASE_INTER2_DELAY,
    LED_PHASE_LOOP3,
    LED_PHASE_LOOP3_DELAY,
    LED_PHASE_INTER3_DELAY,
} led_phase_t;

static struct {
    bool active;
    uint8_t instance;
    struct LedConfig* led;
    uint8_t brightness;
    uint8_t c1;
    uint8_t c2;
    uint8_t c3;
    uint8_t loop1delay;
    uint8_t loop2delay;
    uint8_t loop3delay;
    uint8_t loopcnt1;
    uint8_t loopcnt2;
    uint8_t loopcnt3;
    uint8_t ildelay1;
    uint8_t ildelay2;
    uint8_t ildelay3;
    uint8_t grouprepeats;
    uint8_t group_pos;
    uint8_t i1;
    uint8_t i2;
    uint8_t i3;
    led_phase_t phase;
    bool waiting_delay;
    uint32_t delay_until_ms;
} s_led;

static void led_all_off(struct LedConfig* led) {
    if (led == NULL) {
        return;
    }
    bool invertRed = (led->led_flags & 0x01) != 0;
    bool invertGreen = (led->led_flags & 0x02) != 0;
    bool invertBlue = (led->led_flags & 0x04) != 0;
    if (led->led_1_r != 0xFF) {
        digitalWrite(led->led_1_r, invertRed ? HIGH : LOW);
    }
    if (led->led_2_g != 0xFF) {
        digitalWrite(led->led_2_g, invertGreen ? HIGH : LOW);
    }
    if (led->led_3_b != 0xFF) {
        digitalWrite(led->led_3_b, invertBlue ? HIGH : LOW);
    }
}

static void led_stop_internal(bool clear_mode) {
    struct LedConfig* led = s_led.led;
    s_led.waiting_delay = false;
    if (led != NULL) {
        led_all_off(led);
        if (clear_mode) {
            led->reserved[0] = 0x00;
        }
    }
    memset(&s_led, 0, sizeof(s_led));
    ledFlashActive = false;
    activeLedInstance = 0xFF;
    ledFlashPosition = 0;
}

static void led_schedule_delay_ms(uint16_t ms) {
    if (ms == 0) {
        s_led.waiting_delay = false;
        return;
    }
    s_led.waiting_delay = true;
    s_led.delay_until_ms = millis() + ms;
}

static void led_load_config(struct LedConfig* led) {
    // The 12-byte flash pattern persisted in LedConfig.reserved[] is struct
    // LedFlashPattern (all single bytes, no endianness). Overlay-read to name the
    // fields; the nibble packing (mode/brightness, delay/count) stays hand-decoded.
    const struct LedFlashPattern* p = (const struct LedFlashPattern*)led->reserved;
    s_led.led = led;
    s_led.brightness = (uint8_t)(((p->mode_brightness >> 4) & 0x0F) + 1);
    s_led.c1 = p->color1;
    s_led.c2 = p->color2;
    s_led.c3 = p->color3;
    s_led.loop1delay = (uint8_t)((p->loop1_delay_count >> 4) & 0x0F);
    s_led.loop2delay = (uint8_t)((p->loop2_delay_count >> 4) & 0x0F);
    s_led.loop3delay = (uint8_t)((p->loop3_delay_count >> 4) & 0x0F);
    s_led.loopcnt1 = (uint8_t)(p->loop1_delay_count & 0x0F);
    s_led.loopcnt2 = (uint8_t)(p->loop2_delay_count & 0x0F);
    s_led.loopcnt3 = (uint8_t)(p->loop3_delay_count & 0x0F);
    s_led.ildelay1 = p->inter_loop_delay1;
    s_led.ildelay2 = p->inter_loop_delay2;
    s_led.ildelay3 = p->inter_loop_delay3;
    s_led.grouprepeats = (uint8_t)(p->group_repeats + 1);
    s_led.group_pos = 0;
    s_led.i1 = 0;
    s_led.i2 = 0;
    s_led.i3 = 0;
    s_led.phase = LED_PHASE_GROUP;
    s_led.waiting_delay = false;
}

