davelee98/Firmware_Unified/targets/esp32-idf/src/device_control.cpp
static void led_run_finish(void) {
    led_stop_internal(false);
}

static void led_run_step(void) {
    struct LedConfig* led;
    uint8_t mode;

    if (!s_led.active || s_led.led == NULL) {
        return;
    }
    led = s_led.led;
    activeLedInstance = s_led.instance;
    mode = (uint8_t)(led->reserved[0] & 0x0F);
    if (mode != 1) {
        led_run_finish();
        return;
    }

    for (;;) {
        if (!s_led.active) {
            return;
        }

        switch (s_led.phase) {
            case LED_PHASE_GROUP:
                if (s_led.group_pos >= s_led.grouprepeats && s_led.grouprepeats != 255) {
                    led->reserved[0] = 0x00;
                    led_run_finish();
                    return;
                }
                s_led.i1 = 0;
                s_led.i2 = 0;
                s_led.i3 = 0;
                s_led.phase = LED_PHASE_LOOP1;
                break;

            case LED_PHASE_LOOP1:
                if (s_led.i1 >= s_led.loopcnt1) {
                    if (s_led.ildelay1 > 0) {
                        s_led.phase = LED_PHASE_INTER1_DELAY;
                        led_schedule_delay_ms((uint16_t)(s_led.ildelay1 * LED_DELAY_FACTOR_MS));
                        return;
                    }
                    s_led.phase = LED_PHASE_LOOP2;
                    break;
                }
                flashLed(s_led.c1, s_led.brightness);
                s_led.i1++;
                if (s_led.loop1delay > 0) {
                    s_led.phase = LED_PHASE_LOOP1_DELAY;
                    led_schedule_delay_ms((uint16_t)(s_led.loop1delay * LED_DELAY_FACTOR_MS));
                } else {
                    led_schedule_delay_ms(LED_MIN_STEP_DELAY_MS);
                }
                return;

            case LED_PHASE_LOOP1_DELAY:
                s_led.phase = LED_PHASE_LOOP1;
                break;

            case LED_PHASE_INTER1_DELAY:
                s_led.phase = LED_PHASE_LOOP2;
                break;

            case LED_PHASE_LOOP2:
                if (s_led.i2 >= s_led.loopcnt2) {
                    if (s_led.ildelay2 > 0) {
                        s_led.phase = LED_PHASE_INTER2_DELAY;
                        led_schedule_delay_ms((uint16_t)(s_led.ildelay2 * LED_DELAY_FACTOR_MS));
                        return;
                    }
                    s_led.phase = LED_PHASE_LOOP3;
                    break;
                }
                flashLed(s_led.c2, s_led.brightness);
                s_led.i2++;
                if (s_led.loop2delay > 0) {
                    s_led.phase = LED_PHASE_LOOP2_DELAY;
                    led_schedule_delay_ms((uint16_t)(s_led.loop2delay * LED_DELAY_FACTOR_MS));
                } else {
                    led_schedule_delay_ms(LED_MIN_STEP_DELAY_MS);
                }
                return;

            case LED_PHASE_LOOP2_DELAY:
                s_led.phase = LED_PHASE_LOOP2;
                break;

            case LED_PHASE_INTER2_DELAY:
                s_led.phase = LED_PHASE_LOOP3;
                break;

            case LED_PHASE_LOOP3:
                if (s_led.i3 >= s_led.loopcnt3) {
                    if (s_led.ildelay3 > 0) {
                        s_led.phase = LED_PHASE_INTER3_DELAY;
                        led_schedule_delay_ms((uint16_t)(s_led.ildelay3 * LED_DELAY_FACTOR_MS));
                        return;
                    }
                    s_led.group_pos++;
                    s_led.phase = LED_PHASE_GROUP;
                    led_schedule_delay_ms(LED_MIN_STEP_DELAY_MS);
                    return;
                }
                flashLed(s_led.c3, s_led.brightness);
                s_led.i3++;
                if (s_led.loop3delay > 0) {
                    s_led.phase = LED_PHASE_LOOP3_DELAY;
                    led_schedule_delay_ms((uint16_t)(s_led.loop3delay * LED_DELAY_FACTOR_MS));
                } else {
                    led_schedule_delay_ms(LED_MIN_STEP_DELAY_MS);
                }
                return;

            case LED_PHASE_LOOP3_DELAY:
                s_led.phase = LED_PHASE_LOOP3;
                break;

            case LED_PHASE_INTER3_DELAY:
                s_led.group_pos++;
                s_led.phase = LED_PHASE_GROUP;
                break;

            default:
                led_run_finish();
                return;
        }
    }
}

void processLedFlash() {
    if (!s_led.active) {
        return;
    }
    if (s_led.waiting_delay) {
        if ((int32_t)(millis() - s_led.delay_until_ms) < 0) {
            return;
        }
        s_led.waiting_delay = false;
    }
    led_run_step();
}

void handleLedActivate(uint8_t* data, uint16_t len) {
    if (len < 1) {
        uint8_t errorResponse[] = {RESP_NACK, RESP_LED_ACTIVATE_ACK, 0x01, 0x00};
        sendResponse(errorResponse, sizeof(errorResponse));
        return;
    }
    uint8_t ledInstance = data[0];
    if (ledInstance >= globalConfig.led_count) {
        uint8_t errorResponse[] = {RESP_NACK, RESP_LED_ACTIVATE_ACK, 0x02, 0x00};
        sendResponse(errorResponse, sizeof(errorResponse));
        return;
    }
    struct LedConfig* led = &globalConfig.leds[ledInstance];
    // Payload is [led_instance:1][LedFlashPattern:12]; stash the pattern in reserved[].
    if (len >= 1 + sizeof(struct LedFlashPattern)) {
        memcpy(led->reserved, data + 1, sizeof(struct LedFlashPattern));
    }
    uint8_t mode = (uint8_t)(led->reserved[0] & 0x0F);
    if (mode != 1) {
        led_stop_internal(true);
        uint8_t successResponse[] = {RESP_ACK, RESP_LED_ACTIVATE_ACK, 0x00, 0x00};
        sendResponse(successResponse, sizeof(successResponse));
        return;
    }

    led_stop_internal(false);
    s_led.active = true;
    s_led.instance = ledInstance;
    activeLedInstance = ledInstance;
    ledFlashActive = true;
    ledFlashPosition = 0;
    led_load_config(led);
    led_run_step();

    uint8_t successResponse[] = {RESP_ACK, RESP_LED_ACTIVATE_ACK, 0x00, 0x00};
    sendResponse(successResponse, sizeof(successResponse));
}

void handleLedStop(uint8_t* data, uint16_t len) {
    if (s_led.active && len >= 1 && data[0] != s_led.instance) {
        uint8_t errorResponse[] = {RESP_NACK, RESP_LED_STOP_ACK, 0x02, 0x00};
        sendResponse(errorResponse, sizeof(errorResponse));
        return;
    }
    led_stop_internal(true);
    uint8_t successResponse[] = {RESP_ACK, RESP_LED_STOP_ACK, 0x00, 0x00};
    sendResponse(successResponse, sizeof(successResponse));
}

void processButtonEvents() {
    powerButtonPoll();
#ifdef TARGET_ESP32
    pollConfiguredPowerOffButtons();
#endif
    pollAdcButtons();
    if (buttonEventPending) {
        noInterrupts();
        buttonEventPending = false;
        uint8_t changedButtonIndex = lastChangedButtonIndex;
        lastChangedButtonIndex = 0xFF;
        interrupts();
        od_log_debug("Button event pending: %u", changedButtonIndex);
        if (changedButtonIndex < MAX_BUTTONS && buttonStates[changedButtonIndex].initialized) {
            ButtonState* btn = &buttonStates[changedButtonIndex];
            bool pinState = digitalRead(btn->pin);
            bool logicalPressed = btn->inverted ? !pinState : pinState;
            od_log_debug("Pin state: %d, Logical pressed: %d, inverted: %d", pinState, logicalPressed, btn->inverted);
            uint8_t logicalState = logicalPressed ? 1 : 0;
            btn->current_state = logicalState;
            od_log_debug("Button: %u, Press count: %u, Current state: %u", btn->button_id, btn->press_count, btn->current_state);
            uint8_t buttonData = (btn->button_id & 0x07) |
                                 ((btn->press_count & 0x0F) << 3) |
                                 ((btn->current_state & 0x01) << 7);
            if (btn->byte_index < 11) {
                dynamicreturndata[btn->byte_index] = buttonData;
            }
        }
        updatemsdata();
#ifdef TARGET_NRF
        ble_nrf_boost_advertising();
#endif
    }
}

static inline void ledFlashWrite(uint8_t pin, bool level) {
    if (pin != 0xFF) {
        digitalWrite(pin, level ? HIGH : LOW);
    }
}

void flashLed(uint8_t color, uint8_t brightness) {
    if (activeLedInstance == 0xFF) {
        for (uint8_t i = 0; i < globalConfig.led_count; i++) {
            if (globalConfig.leds[i].led_type == 1) {
                activeLedInstance = i;
                break;
            }
        }
        if (activeLedInstance == 0xFF) return;
    }
    struct LedConfig* led = &globalConfig.leds[activeLedInstance];
    uint8_t ledRedPin = led->led_1_r;
    uint8_t ledGreenPin = led->led_2_g;
    uint8_t ledBluePin = led->led_3_b;
    bool invertRed = (led->led_flags & 0x01) != 0;
    bool invertGreen = (led->led_flags & 0x02) != 0;
    bool invertBlue = (led->led_flags & 0x04) != 0;
    uint8_t colorred = (color >> 5) & 0b00000111;
    uint8_t colorgreen = (color >> 2) & 0b00000111;
    uint8_t colorblue = color & 0b00000011;
    for (uint16_t i = 0; i < brightness; i++) {
        ledFlashWrite(ledRedPin,invertRed ? !(colorred >= 7) : (colorred >= 7));
        ledFlashWrite(ledGreenPin,invertGreen ? !(colorgreen >= 7) : (colorgreen >= 7));
        ledFlashWrite(ledBluePin,invertBlue ? !(colorblue >= 3) : (colorblue >= 3));
        delayMicroseconds(100);
        ledFlashWrite(ledRedPin,invertRed ? !(colorred >= 1) : (colorred >= 1));
        ledFlashWrite(ledGreenPin,invertGreen ? !(colorgreen >= 1) : (colorgreen >= 1));
        delayMicroseconds(100);
        ledFlashWrite(ledRedPin,invertRed ? !(colorred >= 6) : (colorred >= 6));
        ledFlashWrite(ledGreenPin,invertGreen ? !(colorgreen >= 6) : (colorgreen >= 6));
        ledFlashWrite(ledBluePin,invertBlue ? !(colorblue >= 1) : (colorblue >= 1));
        delayMicroseconds(100);
        ledFlashWrite(ledRedPin,invertRed ? !(colorred >= 2) : (colorred >= 2));
        ledFlashWrite(ledGreenPin,invertGreen ? !(colorgreen >= 2) : (colorgreen >= 2));
        delayMicroseconds(100);
        ledFlashWrite(ledRedPin,invertRed ? !(colorred >= 5) : (colorred >= 5));
        ledFlashWrite(ledGreenPin,invertGreen ? !(colorgreen >= 5) : (colorgreen >= 5));
        delayMicroseconds(100);
        ledFlashWrite(ledRedPin,invertRed ? !(colorred >= 3) : (colorred >= 3));
        ledFlashWrite(ledGreenPin,invertGreen ? !(colorgreen >= 3) : (colorgreen >= 3));
        ledFlashWrite(ledBluePin,invertBlue ? !(colorblue >= 2) : (colorblue >= 2));
        delayMicroseconds(100);
        ledFlashWrite(ledRedPin,invertRed ? !(colorred >= 4) : (colorred >= 4));
        ledFlashWrite(ledGreenPin,invertGreen ? !(colorgreen >= 4) : (colorgreen >= 4));
        delayMicroseconds(100);
        ledFlashWrite(ledRedPin,invertRed ? HIGH : LOW);
        ledFlashWrite(ledGreenPin,invertGreen ? HIGH : LOW);
        ledFlashWrite(ledBluePin,invertBlue ? HIGH : LOW);
    }
}

#ifdef TARGET_ESP32
void IRAM_ATTR handleButtonISR(uint8_t buttonIndex) {
#else
void handleButtonISR(uint8_t buttonIndex) {
#endif
    if (buttonIndex >= MAX_BUTTONS || !buttonStates[buttonIndex].initialized) return;
    ButtonState* btn = &buttonStates[buttonIndex];
    bool pinState = digitalRead(btn->pin);
    bool pressed = btn->inverted ? !pinState : pinState;
    uint8_t newState = pressed ? 1 : 0;
    if (newState != btn->current_state) {
        btn->current_state = newState;
        lastChangedButtonIndex = buttonIndex;
        if (pressed) btn->press_count = (btn->press_count + 1) & 0x0F;
        buttonEventPending = true;
    }
}

#ifdef TARGET_ESP32
void IRAM_ATTR buttonISR(void* arg) {
    uint8_t buttonIndex = (uint8_t)(uintptr_t)arg;
    handleButtonISR(buttonIndex);
}
#elif defined(TARGET_NRF)
void buttonISRGeneric() {
    for (uint8_t i = 0; i < buttonStateCount; i++) {
        if (buttonStates[i].initialized) {
            ButtonState* btn = &buttonStates[i];
            bool pinState = digitalRead(btn->pin);
            bool pressed = btn->inverted ? !pinState : pinState;
            uint8_t newState = pressed ? 1 : 0;
            if (newState != btn->current_state) {
                handleButtonISR(i);
                break;
            }
        }
    }
}
#endif

void initButtons() {
    od_log_info("=== Initializing Buttons ===");
    buttonStateCount = 0;
    for (uint8_t i = 0; i < MAX_BUTTONS; i++) {
        buttonStates[i].initialized = false;
        buttonStates[i].button_id = 0;
        buttonStates[i].press_count = 0;
        buttonStates[i].current_state = 0;
        buttonStates[i].byte_index = 0xFF;
        buttonStates[i].pin = 0xFF;
        buttonStates[i].instance_index = 0xFF;
        buttonStates[i].power_off = false;
        buttonStates[i].power_off_hold_ms = 0;
    }
#ifdef TARGET_ESP32
    adcLadderCount = 0;
#endif
    if (globalConfig.binary_input_count == 0) return;
    for (uint8_t instanceIdx = 0; instanceIdx < globalConfig.binary_input_count; instanceIdx++) {
        struct BinaryInputs* input = &globalConfig.binary_inputs[instanceIdx];
#ifdef TARGET_ESP32
        if (input->input_type == BINARY_INPUT_TYPE_ADC_LADDER) {
            registerAdcLadder(input);
            continue;
        }
#endif
        if (input->input_type != OD_INPUT_TYPE_BUTTON) continue;
        if (input->button_data_byte_index > 10) continue;
        uint16_t instanceHoldMs = (input->power_off_hold_sec == 0) ? 3000u : (uint16_t)input->power_off_hold_sec * 1000u;
        uint8_t* instancePins[8] = {
            &input->input_pin_1,&input->input_pin_2,&input->input_pin_3,&input->input_pin_4,
            &input->input_pin_5,&input->input_pin_6,&input->input_pin_7,&input->input_pin_8
        };
        for (uint8_t pinIdx = 0; pinIdx < 8; pinIdx++) {
            if (input->pins_used != 0 && (input->pins_used & (1 << pinIdx)) == 0) {
                continue;
            }
            uint8_t pin = *instancePins[pinIdx];
            if (pin == 0xFF) continue;
            if (touch_input_gpio_is_touch_int(pin)) {
                od_log_debug("Button: skip pin %u (reserved for GT911 INT)", pin);
                continue;
            }
            if (buttonStateCount >= MAX_BUTTONS) break;
            ButtonState* btn = &buttonStates[buttonStateCount];
            btn->button_id = (input->instance_number * 8) + pinIdx;
            if (btn->button_id > 7) btn->button_id = btn->button_id % 8;
            btn->byte_index = input->button_data_byte_index;
            btn->pin = pin;
            btn->instance_index = instanceIdx;
            btn->press_count = 0;
            btn->pin_offset = pinIdx;
            btn->inverted = (input->invert & (1 << pinIdx)) != 0;
            btn->power_off = (input->power_off_flags & (1 << pinIdx)) != 0;
            btn->power_off_hold_ms = instanceHoldMs;
            pinMode(pin, INPUT);
            bool hasPullup = (input->pullups & (1 << pinIdx)) != 0;
#ifdef TARGET_ESP32
            bool hasPulldown = (input->pulldowns & (1 << pinIdx)) != 0;
            if (hasPullup) pinMode(pin, INPUT_PULLUP);
            else if (hasPulldown) pinMode(pin, INPUT_PULLDOWN);
#elif defined(TARGET_NRF)
            if (hasPullup) pinMode(pin, INPUT_PULLUP);
#endif
            delay(10);
            bool initialPinState = digitalRead(pin);
            bool initialPressed = btn->inverted ? !initialPinState : initialPinState;
            btn->current_state = initialPressed ? 1 : 0;
#ifdef TARGET_ESP32
            attachInterruptArg(pin, buttonISR, (void*)(uintptr_t)buttonStateCount, CHANGE);
#elif defined(TARGET_NRF)
            attachInterrupt(pin, buttonISRGeneric, CHANGE);
#endif
            btn->initialized = true;
            buttonStateCount++;
        }
    }
    if (buttonStateCount > 0) {
#ifdef TARGET_ESP32
        for (uint8_t i = 0; i < buttonStateCount; i++) {
            if (buttonStates[i].initialized) {
                gpio_intr_disable((gpio_num_t)digitalPinToGPIONumber(buttonStates[i].pin));
            }
        }
#elif defined(TARGET_NRF)
        for (uint8_t i = 0; i < buttonStateCount; i++) {
            if (buttonStates[i].initialized) {
                detachInterrupt(buttonStates[i].pin);
            }
        }
#endif
        delay(50);
        buttonEventPending = false;
        lastChangedButtonIndex = 0xFF;
        for (uint8_t i = 0; i < buttonStateCount; i++) {
            if (!buttonStates[i].initialized) continue;
            ButtonState* btn = &buttonStates[i];
            bool pinState = digitalRead(btn->pin);
            bool initialPressed = btn->inverted ? !pinState : pinState;
            btn->current_state = initialPressed ? 1 : 0;
            btn->press_count = 0;
        }
#ifdef TARGET_ESP32
        for (uint8_t i = 0; i < buttonStateCount; i++) {
            if (buttonStates[i].initialized) {
                gpio_intr_enable((gpio_num_t)digitalPinToGPIONumber(buttonStates[i].pin));
            }
        }
#elif defined(TARGET_NRF)
        for (uint8_t i = 0; i < buttonStateCount; i++) {
            if (!buttonStates[i].initialized) continue;
            uint8_t pin = buttonStates[i].pin;
            attachInterrupt(pin, buttonISRGeneric, CHANGE);
        }
#endif
    }
}

