davelee98/Firmware_Unified/targets/esp32-idf/src/device_control.cpp
void enterDFUMode() {
    // Banner logged by the dispatcher (commandName() in communication.cpp).

#ifdef TARGET_NRF
    od_log_info("Preparing to enter DFU bootloader mode...");

    Bluefruit.Advertising.restartOnDisconnect(false);

    if (Bluefruit.connected()) {
        od_log_info("Disconnecting BLE...");
        Bluefruit.disconnect(Bluefruit.connHandle());
        delay(100);
    }

    sd_power_gpregret_clr(0, 0xFF);
    sd_power_gpregret_set(0, 0xB1);

    sd_softdevice_disable();

    NVIC->ICER[0] = 0xFFFFFFFF;
    NVIC->ICPR[0] = 0xFFFFFFFF;
#if defined(__NRF_NVIC_ISER_COUNT) && __NRF_NVIC_ISER_COUNT == 2
    NVIC->ICER[1] = 0xFFFFFFFF;
    NVIC->ICPR[1] = 0xFFFFFFFF;
#endif

    sd_softdevice_vector_table_base_set(NRF_UICR->NRFFW[0]);
    __set_CONTROL(0);
    bootloader_util_app_start(NRF_UICR->NRFFW[0]);

    while (1) {}
#endif

#ifdef TARGET_ESP32
    od_log_info("ESP32: Rebooting (OTA typically handled via WiFi)");
    delay(100);
    esp32_ble_deinit_before_restart();
    esp_restart();
#endif
}

void handleDeepSleepCommand(const uint8_t* payload, uint16_t payloadLen) {
    // Banner logged by the dispatcher (commandName() in communication.cpp).
#ifdef TARGET_ESP32
    // Optional 2-byte big-endian seconds payload overrides the configured
    // deep-sleep duration for exactly one cycle. 0x0000 = explicit no-override.
    uint16_t overrideSeconds = 0;
    if (payloadLen >= 2) {
        overrideSeconds = ((uint16_t)payload[0] << 8) | payload[1];
        // Bytes beyond 2 ignored for forward compatibility.
    } else if (payloadLen == 1) {
        od_log_warn("WARNING: malformed 0x%04X payload length 1 - ignoring", CMD_DEEP_SLEEP);
    }
    // Enforce a 60 s floor on host overrides: a very short wake timer risks a rapid
    // sleep/wake churn that never stays awake long enough to service a client. This
    // applies to the OVERRIDE only; overrideSeconds == 0 means "no override" and defers
    // to the configured deep_sleep_time_seconds, which is not subject to this floor.
    constexpr uint16_t MIN_DEEP_SLEEP_OVERRIDE_SECONDS = 60;
    if (overrideSeconds != 0 && overrideSeconds < MIN_DEEP_SLEEP_OVERRIDE_SECONDS) {
        od_log_warn("Override %us below %us floor - clamping", overrideSeconds, MIN_DEEP_SLEEP_OVERRIDE_SECONDS);
        overrideSeconds = MIN_DEEP_SLEEP_OVERRIDE_SECONDS;
    }
    if (globalConfig.power_option.power_mode != 1) {
        od_log_warn("Device not battery powered - 0x%04X rejected", CMD_DEEP_SLEEP);
        uint8_t errorResponse[] = {RESP_NACK, RESP_DEEP_SLEEP, OD_ERR_DEEP_SLEEP_NOT_BATTERY, 0x00};
        sendResponse(errorResponse, sizeof(errorResponse));
        return;
    }
    if (globalConfig.power_option.deep_sleep_time_seconds == 0) {
        od_log_warn("Deep sleep disabled in config - 0x%04X rejected", CMD_DEEP_SLEEP);
        uint8_t errorResponse[] = {RESP_NACK, RESP_DEEP_SLEEP, OD_ERR_DEEP_SLEEP_DISABLED, 0x00};
        sendResponse(errorResponse, sizeof(errorResponse));
        return;
    }
    // Explicit host request: sleep even though the requesting client is connected.
    enterDeepSleep(true, overrideSeconds);
#else
    // Non-ESP32 (nRF etc.) have no timer deep sleep. The protocol permits a NACK here
    // ([0xFF][0x53][OD_ERR_DEEP_SLEEP_UNSUPPORTED][0x00]), but we intentionally stay
    // silent to preserve existing behavior — leave as-is unless a caller needs the NACK.
    (void)payload;
    (void)payloadLen;
    od_log_warn("Deep sleep command not supported on this target");
#endif
}

void handlePowerOffCommand(const uint8_t* payload, uint16_t payloadLen) {
    // Banner logged by the dispatcher (commandName() in communication.cpp).
    // CMD_POWER_OFF request is bare [0x00][0x52]; any trailing payload is RESERVED
    // and ignored (unlike CMD_DEEP_SLEEP 0x0053, this has no duration payload).
    (void)payload;
    (void)payloadLen;
    // powerLatch* are defined on every target (no-op stubs off ESP32; the header
    // guarantees callers need no guards), so no #ifdef TARGET_ESP32 is required here:
    // powerLatchDffConfigured() returns false off-ESP32 -> falls through to the NACK.
    if (powerLatchDffConfigured()) {
        // Fire-and-forget hard rail-cut: queue the ACK, then release the D-FF latch.
        // On latch HW the rail usually drops before the ACK is actually transmitted.
        uint8_t ok[] = {RESP_ACK, RESP_POWER_OFF, 0x00, 0x00};
        sendResponse(ok, sizeof(ok));
        delay(100);
        powerLatchPowerOff();
        return;
    }
    // ANCHOR(power-off-no-latch-fallback): FUTURE WORK for a later agent/implementer.
    // On non-latch BATTERY targets, implement "enter deep sleep with NO wake timer"
    // (sleep indefinitely; wake only on button/reset) as the closest equivalent to a
    // hard power-off, instead of the unsupported NACK below. Caveats before doing so:
    //   1. This DEVIATES from the current protocol, which mandates
    //      OD_ERR_POWER_OFF_UNSUPPORTED (0x00) for non-latch targets — update the
    //      0x0052 @response contract in opendisplay-protocol/src/opendisplay_protocol.h
    //      FIRST, then propagate the header and implement here.
    //   2. enterDeepSleep(true, 0) currently means "use the configured duration", NOT
    //      "no timer" — a genuinely timer-less deep-sleep entry path must be added.
    //   3. Mains-powered targets (power_option.power_mode != 1) must STILL NACK — never
    //      sleep a device that cannot self-repower.
    // Until that lands: capability-gated NACK. Scope: OD_ERR_POWER_OFF_* only — do NOT
    // conflate with 0x53 deep sleep (a device that refuses 0x52 may still accept 0x53).
    od_log_warn("No power latch on this target - 0x%04X rejected", CMD_POWER_OFF);
    uint8_t errorResponse[] = {RESP_NACK, RESP_POWER_OFF, OD_ERR_POWER_OFF_UNSUPPORTED, 0x00};
    sendResponse(errorResponse, sizeof(errorResponse));
}
